//新建
[NewDocumentForm]
groupBox2  =  "Screen Property"
label7  =  "Resolution"
label4  =  "Color"
groupBox4  =  "File Path"
label6  =  "Note:"
label5  =  "Existed project file will be opened if a project already in the selected path folder."
Text  =  "Screen Property Setting"
btOk  =  "OK"
btCancel  =  "Cancel"


//编辑区域
[cfg_DrawAreaForm]
toolStripMenuItem1  = Alignx
toolStripMenuItem2  =  "Resize"
toolStripMenuItem3  =  "Copy     Ctrl+C"
toolStripMenuItem4  =  "Paste    Ctrl+V"
toolStripMenuItem5  =  "Delete   Del"
toolStripMenuItem6  =  "Undo     Ctrl+Z"
toolStripMenuItem7  =  "Front"
toolStripMenuItem8  =  "Back"
toolStripMenuItem9  =  ""
toolStripMenuItem10  =  "Zoom In"
toolStripMenuItem11  =  "Zoom Out"
toolStripMenuItem12  =  "Select All  Ctrl+A"
toolStripMenuItem13  =  "Select the same type"
toolStripMenuItem14 =  ""
toolStripMenuItem15 =  ""
toolStripMenuItem16 =  ""
toolStripMenuItem17 =  ""
toolStripMenuItem18 =  ""
toolStripMenuItem19 =  ""
toolStripMenuItem20  =  "Left"
toolStripMenuItem21  =  "Center"
toolStripMenuItem22  =  "Right"
toolStripMenuItem23  =  "Up"
toolStripMenuItem24  =  "Middle"
toolStripMenuItem25  =  "Bottom"
toolStripMenuItem26  =  "Same Width"
toolStripMenuItem27  =  "Same Height"
toolStripMenuItem28  =  "Equalize"
toolStripMenuItem29 =  ""
toolStripMenuItem30 =  ""
toolStripMenuItem31 =  ""
toolStripMenuItem32 =  ""
toolStripMenuItem33 =  ""
toolStripMenuItem34 =  ""
toolStripMenuItem35 =  ""
toolStripMenuItem36 =  ""
toolStripMenuItem37 =  ""
toolStripMenuItem38 =  ""
toolStripMenuItem39 =  ""
toolStripMenuItem40 =  ""
toolStripMenuItem41 =  ""
toolStripMenuItem42 =  ""
toolStripMenuItem43 =  ""
toolStripMenuItem44 =  ""
toolStripMenuItem45 =  ""
toolStripMenuItem46 =  ""
toolStripMenuItem47 =  ""
toolStripMenuItem48 =  ""
toolStripMenuItem49 =  ""
toolStripMenuItem50 =  ""

//主菜单
[FormMain]
tabPage1 = "File"  
myButton1 = "New"  
myButton2 = "Open"  
myButton3 = "Save"  
myButton4 = "SaveAs"  
myButton5  = "Generate"  
myButton6  = "Close"            
myButton7  = "Export"  
myButton8  = "Import" 
myButton126="Net"
myButton127="Stop Net"
             
tabPage13="Common"      
myButton61  = "New"  
myButton65  = "Save"  
myButton64  = "Generate"  
myButton62  = "Import"  
myButton96  = "Check"  
myButton95  = "Preview from current page"  
myButton94  = "Preview from first page"      
myButton98  = "Set resolution"  
myButton97  = "DGUS UART Tool"   
myButton81  = "VAR_Icon Dispaly"  
myButton80  = "Animation Icon"           
myButton79  = "Slide Dispaly"     
myButton78  = "Artistic Varibles"  
myButton77  = "Picture Animation Display"  
myButton76 = "Icon Rotating"
myButton75 = "Bit Icon"
myButton74 = "Data Variable Display"
myButton73 = "Text Dispaly"
myButton72 = "Clock Display"
myButton71 = "RTC Display"
myButton70 = "Basic Graphic"
myButton112 = "Special industry applications"
myButton68 = "QR Code"
myButton67 = "Area Scrolling Display"
myButton66 = "Data Window Display"
myButton107 = "Dynamic Curve"
myButton93 = "Variables Input"
myButton92 = "Popup Menu"
myButton90 = "Increment Adjustment"
myButton82 = "Drag Adjustment"
myButton91 = "Basic Touch Module"
myButton88 = "Return Key Code"
myButton87 = "ASCII Text Input"
myButton108 = "GBK Input"
myButton89 = "Setting"
myButton86  = "Synchrodata Return"  
myButton85  = "Rotation Adjustment"  
myButton84  = "Sliding Adjustment"  
myButton83  = "Page Sliding"        
myButton110  = "Brightness"  
myButton102  = "Copy"     
myButton101  = "Paste"         
myButton100  = "Delete"     
myButton104  = "Front"  
myButton103  = "Back"  
myButton99  = "Undo" 

tabPage3  = "Icon Show"   
myButton9  = "VAR_Icon Dispaly"        
myButton10  = "Animation Icon"  
myButton11  = "Slide Dispaly"  
myButton12  = "Artistic Varibles"  
myButton13  = "Picture Animation Display"  
myButton14  = "Icon Rotating"  
myButton15  = "Bit Icon"  
myButton18  = "Clock Display"  
myButton21  = "data translate"  
myButton115  = "DGUS II Text"  
myButton116  = "Icon page trans"  
myButton118  = "Icon Overlay"  
myButton119  = "Batch Var Icon"  
myButton121  = "GTF"  
myButton123  = "Video" 

tabPage14  = "Text Show"  
myButton16  = "Data Variable Display"  
myButton17  = "Text Dispaly"  
myButton19  = "RTC Display"  
myButton114  = "HEX Data"  
myButton113  = "Text scroll"  
myButton24  = "Data Window Display"  
myButton120  = "Roll Char" 

tabPage15  = "Graph Show"  
myButton105  = "Dynamic Curve"  
myButton20  = "Basic Graphic"  
myButton23  = "Area Scrolling Display"  
myButton22  = "QR Code"  
myButton109  = "Brightness"  
myButton129  = "progress bar"

tabPage2 ="Touch"
myButton25= "Variables Input"
myButton26= "Popup Menu"
myButton27= "Increment Adjustment"
myButton28= "Drag Adjustment"
myButton29= "Basic Touch Module"
myButton30= "Return Key Code"
myButton31= "ASCII Text Input"
myButton32= "Setting"
myButton33= "Synchrodata Return"
myButton34= "Rotation Adjustment"
myButton35= "Sliding Adjustment"
myButton36= "Page Sliding"
myButton117= "Sliding icon sel"
myButton124= "Bit Button"
myButton106= "GBK Input"

tabPage4= "Edit Tool"
myButton37= "Left"
myButton38= "Center"
myButton39= "Right"
myButton40= "Up"
myButton41= "Center"
myButton42= "Bottom"
myButton43= "Equalize"
myButton44= "Same width"
myButton45= "Same height"
myButton46= "Copy"
myButton47= "Paste"
myButton48= "Delete"
myButton49= "Undo"
myButton52= "Front"
myButton53= "Back"
myButton125= "Array"

tabPage6= "Setting"
myButton57= "Set resolution"
myButton58= "DGUS Serial Port"
myButton128= "Portrait" 

tabPage5 ="Show"
myButton54 ="Check Variable"
myButton55 ="Preview from current"
myButton56 ="Preview from First"
btnDebug ="Debug"

string_1 = Save the file, or you may lose change.
string_2 = Reminder
string_3 = Open new or an existing


//列表
[DummyTaskList]
toolStripButton5 = "Add"
toolStripButton5_ToolTipText = "Add"   
toolStripDropDownButton2 = "Delete"
删除ToolStripMenuItem = "Delete selected"
删除ToolStripMenuItem_ToolTipText = "Delete selected"
删除所有ToolStripMenuItem = "Delete all"
删除所有ToolStripMenuItem_ToolTipText = "Delete all"
toolStripButton6 = "Up"
toolStripButton7 = "Down"
Position = "Location"
Column1 = "Files"

string_1 = Open new or an existing
string_2 = current file will be skipped and ignored in the project if empty value on file name or clicking 'cancel'.
string_3 = File Redefine

toolStripButton3="replace"

//欢迎
[DGUS_Welcome]
linkLabel1  = "New" 
linkLabel2  = "Open file"  
groupBox2  = "Engineering managemet"  
linkLabel12  = "History"   
groupBox3  = "DGUS config tool"   
linkLabel6  = "UART Download Tool"   
linkLabel10  = "Pictures conversions"     
linkLabel3  = "DWIN ICL generation"    
linkLabel4  = "0# word bank generating"   
linkLabel5  = "Do you know?"    
groupBox1  = "Help"    
linkLabel9  = "Free Hotline : 400-018-9008"      
linkLabel7  = "Web: www.dwin.com.cn"  
groupBox5  = "Identified parameter" 
label1  = "Maximum variables per page"     
label8  = "ICON display mode"         
CK_AutoData  = "Data auto-uploading"        
groupBox4  = "Font"       
label3  = "Font colour"
label15  = "Font ID"   
label11  = "Font size"    
TabText  = "Welcome"

label4="OS Version"
linkLabel14="Config Generator"
linkLabel13="WAE Generator"
linkLabel15="Gray Word Library Generator"
linkLabel16="Network Communication"
link_Keyboard="Keyboard"
link_RoleChar="Roll Char"
link_DGUS_Font="DGUS Font"
comboBox3_item0="Lower than V21"
comboBox3_item1="Higher than V21"
comboBox1_item0="transparent"
comboBox1_item1="background show"
label2="【No.0 Font Library】:It generates the No.0 font profile for DWIN DGUS.No.0 Font which included the matrix font in different size as below:4*8 - 64*128"

[DGUS_Design]
TabText  = "Touch and display config"

[Btn_PropertyFrom]
label2 =  "Control display"
ComboBox1String_1 = All
ComboBox1String_2 = Touch control show only
ComboBox1String_3 = Display control show only
checkBox3 =  "Get the pic RGB value"
checkBox1 =  "show control label"
groupBox1 =  "Quick configuration"
button1 =  "OK"
label3 =  "Configuration quantity"
label1 =  "Variable pointer increment"
groupBox3 =  "Group configuration"
button7 =  "Slide configuration"
button6 =  "RTC setting"
button4 =  "Text input"
button3 =  "Data input"
button8 = "Voice ID Modify"
groupBox2 =  "Gridding control"
label8 =  "Gridding colour"
label7 =  "Gridding density"
label6 =  "Y direction offset"
label5 =  "X direction offset"  
checkBox2 =  "Show gridding"
groupBox4 =  "Quick setting"
button5 =  "Edit properties"
label9 =  "Bulk selection:"
ComboBox2String_1 = Variable data input
ComboBox2String_2 = Popup menu
ComboBox2String_3 = Incremental adjustment
ComboBox2String_4 = Drag adjustment
ComboBox2String_5 = Sliding adjustment condition
ComboBox2String_6 = Basic touch module
ComboBox2String_7 = Data return
ComboBox2String_8 = Text input
ComboBox2String_9 = Page sliding
ComboBox2String_10 = Variables icon display
ComboBox2String_11 = Animation icon display
ComboBox2String_12 = Sliding data indication
ComboBox2String_13 = Artistic variables display
ComboBox2String_14 = Image animation display
ComboBox2String_15 = Icon rotation indication
ComboBox2String_16 = Bit variables icon display
ComboBox2String_17 = Data variables display
ComboBox2String_18 = Text display
ComboBox2String_19 = Dial clock display
ComboBox2String_20 = Textual RTC display
ComboBox2String_21 = Data window
ComboBox2String_22 = Zone rolling
ComboBox2String_23 = QR code display
ComboBox2String_24 = Zone light
ComboBox2String_25 = DGUSII text
button2 =  "Select all"
TabText =  "Property"
string_1 = Select one or more same-type button
string_2 = Unable to modified button in different type
string_3 = No bulk setting
label11="Value"
button9="Total increase"
button10="Total reduction"
strInfo="Once clicked, the variable address of all controls will be changed to the original address plus adjustments (except variable address 0). If clicked cancel, no adjustments will be made.！"
strInfo2="Once clicked, the variable address of all controls will be changed to the original address minus the adjustment amount (except the variable address is reduced to 0). If clicked cancel, no adjustment will be made！"
checkBox4="Lock"
checkBox5="UnLock"
myGroupBox1="VP modify"
btnAddSelect="add select"
btnSubSelect="sub select"


//图标变量
[ICOvariableForm]
label9  =  "SP (0x)"
label16  =  "Name"
label8  =  "Display Mode"
label7  =  "Icon File"
label5  =  "Icon ID"
label6  =  "Icon ID"
label4  =  "Maximum"
label3  =  "Minimum"
label2  =  "VP (0x)"
label19  =  "Initial value"
Text  =  "Variables Icon"
comboBox1String_1 =  "Transparence"
comboBox1String_2 =  "Show Background"

label10="Background transparent Mode"
label13="Background brightness"
label14="ICON brightness"
label15="Filter Set"
cb2_item0="Overlay"
cb2_item1="Overlay Mode 1"
cb2_item2="Overlay Mode 2"
cbox_popshow="show in pop menu"

//动画图标显示  
[Anim_DisICOForm]
comboBox1String_1 = "Transparence"
comboBox1String_2 = "Background display"
label16  =  "Name"
label8  =  "Display mode"
label7  =  "Icon file"
label4  =  "Start value"
label3  =  "Stop value"
label2  =  "VP (0x)"
label1  =  "SP (0x)"
label9  =  "End icon ID"
label5  =  "Start icon ID"
label6  =  "stop icon ID"
label10  =  "Initial value"
Text  =  "Animation Icon"

label12="Time of Single ICON(unit:DGUS cycle)"
label11="Background transparent Mode"
label13="Background brightness"
label15="ICON brightness"
label14="Animation display Mode"
label17="Filter Set"
label18="Stop Ico"
cb2_item0="Overlay"
cb2_item1="Overlay Mode 1"
cb2_item2="Overlay Mode 2"
cb3_item0="Loop"
cb3_item1="Single"
cb4_item0="Not Reset"
cb4_item1="Reset"
cb4_item2="Current Icon"



//Sliding scale指示设置
[SliderSetForm]
label10  =  "Teriminated Value"
LableA  =  "System will leave initial and terminated value as the default Operating area"
label13  =  "Variable type"
label6  =  "(X)Coordinate offset"
label4  =  "Y Coordinate "
label8  =  "Display mode"
label7  =  "Icon file"
label5  =  "Slide icon"
label14  =  "SP (0x)"
label9  =  "Terminal Value"
label16  =  "Name"
label3  =  "Initial Value"
label2  =  "VP (0x)"
label15  =  "Initial value"
label12 = "Slider mode"
Text  =  "Slider Display"
comboBox1String_1 =  "Transparence"
comboBox1String_2 =  "Background display"
comboBox2String_1 =  "Horizontal"
comboBox2String_2 =  "Vertical"
comboBox3String_1 =  "Word"
comboBox3String_2 =  "High byte"
comboBox3String_3 =  "Low byte"
String_1 =  "Y Coordinate"
String_2 =  "(X)Coordinate offset"
String_3 =  "X Coordinate"
String_4 =  "(Y)Coordinate offset"

label18="Background transparent Mode"
label17="Background brightness"
label19="ICON brightness"
label20="Filter Set"
cb4_item0="Overlay"
cb4_item1="Overlay Mode 1"
cb4_item2="Overlay Mode 2"

//艺术字变量显示
[ArtTextSetForm]
label9  =  "ICON_ID corresponding to 0, order is 0123456789-."
label1  =  "Alignment"
label13  =  "Variable type"
label6  =  "Integer digits"
label8  =  "Display mode"
label5  =  "Decimal digits"
label11  =  "Start icon"
label12  =  "Name"
label14  =  "Icon file"
label15  =  "VP (0x)"
label17  =  "SP (0x)"    
label10  =  "Initial value"
TabText  =  "Artistic variables display"
label3="Background transparent Mode"
label2="Background brightness"
label4="ICON brightness"
label7="Filter Set"
checkBox_show0="Whether an invalid 0 is displayed"

comboBox1String_1 =  "Transparence"
comboBox1String_2 =  "Background display"
comboBox3String_1 =  "int (2 bytes)"
comboBox3String_2 =  "Long int (4 bytes)"
comboBox3String_3 =  "*VP high byte"
comboBox3String_4 =  "*VP low byte"
comboBox3String_5 =  "Extra long int (8 bytes)"
comboBox3String_6 =  "Unsigned int (2 bytes)"
comboBox3String_7 =  "Unsigned Long lnt (4 bytes)"
comboBox3String_8 =  "float（4 bytes）"
comboBox3String_9 =  "double（8 bytes）"
comboBox2String_1 =  "Left"
comboBox2String_2 =  "Right"
comboBox2String_3 =  "Center"
cb4_item0="Overlay"
cb4_item1="Overlay Mode 1"
cb4_item2="Overlay Mode 2"

//图片动画显示
[ImgAnimate]
label2  =  "SP (0x)"
label3  =  "RTC Setting"
label6  =  "Start pic ID"
label5  =  "End pic ID"
label16  =  "Name"
TabText  =  "Image animation Display"
button5="set"
label7="icl lib id"
label19="Pic End ID"
myGroupBox1="icl lib id(0x00:value of file of cfg)"
//图标旋转指示
[ICONRotate]
label6  =  "Rotation center,as the coordinate of upper left of configure button"
label17  =  "Angle of rotation,          0-720(0x000-0x2D0),Unit: 0.5°"
button2  =  "Rotating demonstration "
label13  =  "End angle"
label14  =  "Start angle"
label9  =  "End Variable"
label12  =  "Start  Variable"
label2  =  "VP (0x)"
label15  =  "SP (0x)"
label4  =  "Icon ID"
label7  =  "Icon file"
label16  =  "Name"
label19  =  "Initial value"
TabText  =  "Icon rotation indication"
label3 = "ICON Rotation Center:"
label8 = "Diaplay Mode"
label5="Filter Set"

comboBox1String_1 =  "Transparence"
comboBox1String_2 =  "Background display"
comboBox2String_1 =  "Int"
comboBox2String_2 =  "high byte"
comboBox2String_3 =  "low byte"

//位变量图标显示
[bitIconForm]
button3  =  "Setting"
label15  =  "Display mode"
label14  =  "Interval"
label11  =  "Moving mode"
label8  =  "Display mode"
label7  =  "Icon file"
label10  =  "AP(0x)"
label16  =  "Name"
label2  =  "VP (0x)"
label1  =  "SP (0x)"
label4  =  "Initial value"
Text  =  "Bit icon display"
label18="Filter Set"
comboBox3String_1 =  "Transparence"
comboBox3String_2 =  "Background display"

//位控制设置
[ActBitSetForm]
button1 = "OK"
button2 = "Cancel"
Text = "Bit Control setting"

//数据变量显示"
[DataVarForm]
label14  =  "Unit character string，ASCII code"
label3  =  "Show unit "
label13  =  "Decimal digits"
label9  =  "Integer digits"
label12  =  "Variable type"
label11  =  "Font size"
label15  =  "Word bank ID"
label7  =  "Show colour"
label8  =  "Variable unit length"
label10  =  "Alignment"
label2  =  "VP (0x)"
label4  =  "SP (0x)"
label16  =  "Name"
label17  =  "Initial value"
TabText  =  "Data variables display"
Text  =  "Data variables display"
checkBox1="Automatic Character Spacing Adjustment"
checkBox2="Display Invalid Zero"
cbox_popshow="show in pop menu"

comboBox1String_1 =  "Left"
comboBox1String_2 =  "Right"
comboBox1String_3 =  "Center"
Cb_vartypeString_1 =  "Int (2 bytes)"
Cb_vartypeString_2 =  "Long lnt (4 bytes)"
Cb_vartypeString_3 =  "*VP high byte"
Cb_vartypeString_4 =  "*VP low byte"
Cb_vartypeString_5 =  "Extra long lnt (8 bytes)"
Cb_vartypeString_6 =  "Unsigned Int (2 bytes)"
Cb_vartypeString_7 =  "Unsigned Long lnt (4 bytes)"
Cb_vartypeString_8 =  "float（4 bytes）"
Cb_vartypeString_9 =  "double（8 bytes）"

//文本显示
[TextdisForm]
label3  =  "Text color(0x)"
label12  =  "Encoding Mode"
label6  =  "Font ID of the ASCII in coding"
label10  =  "Font ID of coding 0x00,0x05,and \r\nnon ASCII in coding 0x01-0x04"
checkBox1  =  "Set character interval Manually"
label14  =  "Text Length"
label13  =  "Vertical interval"
label18  =  "Horizontal interval"
label9  =  "Y direction Lattice number"
label11  =  "X direction Lattice number"
label16  =  "Name"
label7  =  "SP (0x)"
label2  =  "VP (0x)"
label17  =  "Initial value"
Text  =  "Text display"

cb_adjust="adjustment character spacing"
label19="horizontal"
label20="vertical"
cbox_popshow="show in pop menu"

Cb_vartypeString_1 =  "0x00=8bit"
Cb_vartypeString_2 =  "0x01=GB2312"
Cb_vartypeString_3 =  "0x02=GBK"
Cb_vartypeString_4 =  "0x03=BIG5"
Cb_vartypeString_5 =  "0x04=SJIS"
Cb_vartypeString_6 =  "0x05=UNICODE"

cb1_item0="up"
cb1_item1="center"

cb2_item0="Left alignment"
cb2_item1="Right alignment"
cb2_item2="Center alignment"
cb2_item3="Right to Left"

[DGUSTextdisForm]
label3  =  "Text color(0x)"
label12  =  "Encoding Mode"
label6  =  "Font ID of the ASCII in coding"
label10  =  "Font ID of coding 0x00,0x05,and \r\nnon ASCII in coding 0x01-0x04"
checkBox1  =  "adjustment character spacing"
label14  =  "Text Length"
label13  =  "Vertical interval"
label18  =  "Horizontal interval"
label9  =  "Align"
label11  =  "X direction Lattice number"
label16  =  "Name"
label7  =  "SP (0x)"
label2  =  "VP (0x)"
label17  =  "Initial value"
Text  =  "Text display"

cb_adjust="don't adjustment character spacing"
label19="Text zoom"
label20="vertical"
cbox_popshow="show in pop menu"

Cb_vartypeString_1 =  "0x00=8bit"
Cb_vartypeString_2 =  "0x01=GB2312"
Cb_vartypeString_3 =  "0x02=GBK"
Cb_vartypeString_4 =  "0x03=BIG5"
Cb_vartypeString_5 =  "0x04=SJIS"
Cb_vartypeString_6 =  "0x05=UNICODE"

cb1_item0="up"
cb1_item1="center"

cb2_item0="Left alignment"
cb2_item1="Right alignment"
cb2_item2="Center alignment"
cb2_item3="Right to Left"
//表盘时钟设置
[ClockDis]
checkBox1  =  "Hide Hour hand" 
label3  =  "Hour icon"           
label11  =  "Center coordinate"
label6  =  "Minute icon"
label5  =  "Center coordinate"
checkBox2  =  "Hide Minute hand"
label12  =  "Second icon"
label9  =  "Center coordinates"
checkBox3  =  "Hide Second hand"
label7  =  "Icon file"
label2  =  "Center location of clock\r\nis the top left corner coordinate"
label4  =  "SP (0x)"
label16  =  "Name"
Text =  "Clock Display"



//RTC显示
[RTCDISForm]
checkBox1  =  "Display week"
label2  =  "Date format:"
label12  =  "RTC code table:"
label18  =  "Made up by RTC code table and ASCII character "
label28  =  "Q"
label29  =  "Minute"
label26  =  "H"
label27  =  "Hour"
label24  =  "D"
label25  =  "Day"
label22  =  "M"
label23  =  "Month"
label20  =  "Y"
label21  =  "Year"
label19  =  "Code"
label8  =  "Instruction"
label32  =  "W"
label33  =  "Week"
label30  =  "S"
label31  =  "Second"
label6  =  "M-D W H:Q display as"
label7  =  "2017-10-01  12:00:00"
label14  =  "Y-M-D H:Q:S display as"
label13  =  "2017-10-01 12:00:00 Wednesday"
label10  =  "10-01 WED 12：00"
label9  =  "Assumed the time is:"
label1  =  "SP (0x)"
label4  =  "SP (0x)"
label11  =  "X direction lattice number"
label15  =  "Font Lib_ID"
label3  =  "Font color"
label16  =  "Name"
Text  =  "RTC display"
checkBox2="Automatic Character Spacing Adjustment"
//基本图形显示
[BaseGraphs]
label4  =  "VP (0x)"
label5  =  "SP (0x)"
label16  =  "Name"
label8  =  "Use segment drawing instruction： 0x02,0x03,0x09,0x0A\r\n segment will show as dotted line"
checkBox1  =  "Dotted line"
groupBox1  =  "Set dotted line format"
TabText  =  "Basic graphics display"


//特殊行业应用
[BaseApplyForm]
label2 = "VP (0x)"
label3 = "SP (0x)"
label16 = "Name"
TabText = "Special industry apply"

//QR code
[QRCodeForm]
label8  =  "Unit_Pixels"
label2  =  "VP (0x)"
label4  =  "SP (0x)"
label16  =  "Name"
Text  =  "QR code"

label12="Fix mode"
label3="display color"
label5="background"
label6="QR"

cb1_item0="black white"
cb1_item1="user define"
cb2_item0="fit to the size"
cb2_item1="fixed 73*73"

//区域滚屏显示
[ZonescrollingForm]
label1  =  "SP (0x)"      
label5  =  "Move method"           
groupBox1  =  "Rolling speed"           
label8  =  "Displacement per cycle(pixel)"
label2  =  "VP (0x)"
label4  =  "SP (0x)"
label16  =  "Name"
TabText  =  "Zone rolling"
comboBox2String_1 =  "Left"  
comboBox2String_2 =  "Right"
comboBox2String_3  =  "Up"
comboBox2String_4 =  "Down"

//数据窗口指示
[DataWindowForm]
groupBox1  =  "Display mode"  
checkBox3  =  "Cyclic data"
checkBox2  =  "Display positive (+)"
checkBox1  =  "Display invalid"
label8  =  "Step length"
label6  =  "Display data amount"
label4  =  "Integer digits"
label5  =  "Decimal digits"
label1  =  "Upper limit of data"
label11  =  "Lower limit of data"
label16  =  "Name"
label7  =  "SP (0x)"
label2  =  "VP (0x)"
groupBox2  =  "Data characteristics"
groupBox4  =  "Select data"
label12  =  "Y direction size" 
label13  =  "X direction size"
label14  =  "Show color"
groupBox3  =  "Not select data"
label10  =  "Y direction size"
label9  =  "X direction size"
label3  =  "Show color"
Text  =  "Data window"
checkBox4="Automatic Character Spacing Adjustment"
label15="Font lib"
//预览窗口
[PreviewForm]
label2 = "Double click window border to quit"
label1="virtual screen"
label5="port"
label6="rate"
btnOpen="open"
btnFrmCom="record"
btnComSet="serialport set"
btnDebug="debug"

//变量数据录入
[DGUSForm]
Dis_Pass  =  "Display as * when input"
label10  =  "Show location"
label9  =  "Keyboard area"
label8  =  "Current page"
button1  =  "Set"
button22  =  "Keyboard setting"
label16  =  "Name"
checkBox2  =  "No button effect"
button5  =  "set"
label19  =  "Button effect:"
checkBox1  =  "Enabling limits"
label20  =  "Max"
label17  =  "Min"
checkBox3  =  "Data auto-uploading"
checkNext  =  "No page switching"
label21  =  "Page switching:"
button6  =  "set"
checkBox4  =  "Loading data when input"
label26  =  "Loading data"
label25  =  "Data address(0x)"
label13  =  "Decimal digits"
label22  =  "Keyboard location"
label2  =  "Display method"
label15  =  "Cursor color"
label1  =  "Integer digits"
label7  =  "Font size"
label6  =  "Font ID"
label5  =  "Show colour"
label4  =  "Show location"
label3  =  "Variable type"
label11  =  "VP (0x)"
label23  =  "Initial value"
TabText  =  "Variable data input"
Text  =  "Variable data input"
label24="Background transparency"
Cb_vartypeString_1 =  "Int (word)"
Cb_vartypeString_2 =  "Long int (double word)"
Cb_vartypeString_3 =  "High Byte"
Cb_vartypeString_4 =  "Low Byte"
Cb_vartypeString_5 =  "Extra long int(8 bytes)"
Cb_vartypeString_6 =  "float"
Cur_ColorString_1 =  "Black"
Cur_ColorString_2 =  "White"
comboBox1String_1 =  "Show \'*\'"
comboBox1String_2 =  "Direct display"
comboPostioString_1 =  "Current page"
comboPostioString_2 =  "Other page"
comboPostioString_3 =  "Keyboard configuration"

//弹出菜单配置
[PopMenuForm]
label11  =  "VP (0x)"
label3  =  "Variable type"
button1  =  "Setting"
label10  =  "Show location"
label9  =  "Menu area "
button22  =  "Popup menu Setting"
label8  =  "Page ID"
label16  =  "Name"
checkBox2  =  "No button effect"
label19  =  "Button effect:"
button5  =  "set"
checkBox3  =  "Data auto-uploading"
label6  =  "Bit Num(0x)"
radioButton4  =  "Bit"
radioButton3  =  "Low Byte"
radioButton2  =  "High Byte"
radioButton1  =  "Int"
Text  =  "Popup menu configuration"
label1="Background transparency"
//增量调节
[IncAdjustForm]
label11  =  "VP (0x)"
label3  =  "Variable type"
label16  =  "Name"
checkBox2  =  "No button effect"
label19  =  "Button effect:"
button5  =  "set"
checkBox3  =  "Data auto-uploading"
label6  =  "Bit num(0x)"
radioButton4  =  "Bit"
radioButton3  =  "Low Byte"
radioButton2  =  "High Byte"
radioButton1  =  "Int"
label9  =  "Upper limit"
label10  =  "Lower limit"
label5  =  "Over limit Operation"
label4  =  "Adjusting step length"
label1  =  "Adjust method" 
label7  =  "delay time(100ms)"
label8  =  "Touch effect"
TabText  =  "Incremental adjustment"
Cb_vartypeString_1 =  "Adjust by byte"
Cb_vartypeString_2 =  "Adjust high byte"
Cb_vartypeString_3 =  "Adjust  low byte"
comboBox2String_1 =  "Stop"
comboBox2String_2 =  "Cycle"
comboBox3String_1 =  "Constant Setting"
comboBox3String_2 =  "Disposable Setting"


//拖动调节
[DragManagerForm]
groupBox1  =  "Dragging mode"
label1  =  "Data return mode"
label5  =  "Dragging mode"
checkBox3  =  "Data auto-uploading"
label9  =  "End Value"
label10  =  "Start Value"
label16  =  "Name"
label11  =  "VP (0x)"
label17  =  "Initial value"
TabText  =  "Drag adjustment"
comboBox1String_1 =  "Int"
comboBox1String_2 =  "High Byte"
comboBox1String_3 =  "Low Byte"
comboBox2String_1 =  "Horizontal"
comboBox2String_2 =  "Vertical"

//滑动图标选择
[PageDragManagerForm]
TabText = "slide icon"
groupBox1 = "slide mode"
label3="Note: The size of this control should be the same as the corresponding icon page translation control."
label5 = "slide mode"
label9 = "slide speed"
label10 = "screen ID"
label11 = "VP(0x)"
label16 = "name"
checkBox3="auto upload"
comboBox2String_1 =  "horizontal"
comboBox2String_2 =  "vertical"


//按键值返回配置
[TouchReturnForm]
button1 = "set"
button5 = "set"
label11  =  "VP (0x)"
label16  =  "Name"
label5  =  "返回值保存方式"
label19  =  "Button effect:"
checkBox2  =  "No button effect"
checkBox1  =  "No page switching"
label1  =  "Page switching:"
groupBox3  =  "key value(0x)"
checkBox5  =  "Full QWER keyboard"
label6  =  "Bit Index"
radioButton4  =  "Bit"
radioButton3  =  "Low byte"
radioButton2  =  "High Byte"
radioButton1  =  "Int"
checkBox3  =  "Basic Touch"
checkBox4  =  "Data auto-uploading"
Text  =  "Return Key code"
label3 = "Notes:\r\n"Basic Touch Control" refers numerical keypad,please value all numerical keys with following valid key code:\r\n0x0030-0x0039 (0-9), \r\n0x002E(.),\r\n0x002D(+/-),\r\n0x00F0(Cancel),\r\n0x00F1(Confirm/OK),\r\n0x00F2(Backspace)." 
label4="Hold Time(Unit:0.1s):"

//ASCII录入
[TextInputForm]
label4  =  "Input display area "
button1  =  "Set"
label10  =  "Show location"
label9  =  "Keyboard area"
button22  =  "Keyboard setting"
label8  =  "Page ID"
label16  =  "Name"
button3  =  "Set"
checkBox2  =  "No button effect"
button5  =  "set"
label19  =  "Button effect:"
checkBox3  =  "Data auto-uploading"
checkBox1  =  "Upload Value as typing"
checkNext  =  "No page switching"
label17  =  "Page switching:"
button6  =  "set"
label22  =  "Keyboard location"
label20  =  "Font Height"
label3  =  "Input Mode"
label15  =  "Cursor color"
label1  =  "Text Length"
label7  =  "Font Width"
label6  =  "Font Lib_ID"
label5  =  "Font Color"
label11  =  "VP (0x)"
label2  =  "Display Mode"
Text  =  "ASCII Text Input"
label24  =  "Background transparency"
label21  =  "Initial value"
Cur_ColorString_1 =  "Black"
Cur_ColorString_2 =  "White"
comboBox1String_1 =  "Direct display"
comboBox1String_2 =  "Masked by(*)"
comboBox2String_1 =  "Re-input"
comboBox2String_2 =  "Edit Text"
comboPostionString_1 =  "Current page"
comboPostionString_2 =  "Other pages"



//Parameter configuration
[ParamConfigForm]
button1 = "set"
button5 = "set"
label16  =  "Name"
label19  =  "Button effect："
checkBox2  =  "No button effect"
checkBox1  =  "No page switching"
label1  =  "Page switching："
checkBox4  =  "Data auto-uploading"
Text  =  "Parameter configuration"

//同步数据返回
[K_DO_RETForm]
label16  =  "Name"
checkBox2  =  "No button effect"
label19  =  "Button effect:"
button5  =  "set"
groupBox5  =  "Loosen pressing"
label12  =  "Data length"
label15  =  "Mode"
groupBox4  =  "Continuous pressing"
label8  =  "Data length"
label11  =  "Mode"
groupBox3  =  "First press"
label7  =  "Data length"
label4  =  "Mode"
checkNext  =  "No page switching"
label1  =  "Page switching:"
button1  =  "set"
Text  =  "Synchrodata return"


//转动调节
[RotateadjustForm]
label16  =  "Name"
checkBox2  =  "No button effect"
label19  =  "Button effect:"
button5  =  "set"
label12  =  "Return value"
label11  =  "Return value"
label9  =  "A1(end angle)"
label10  =  "A0(start angle)"
label8  =  "R1(outer diameter)"
label7  =  "Center coordinate"
label5  =  "R0(inner diameter)"
label6  =  "VP (0x)"
label4  =  "Data format"
checkNext  =  "No page switching"
label1  =  "Page switching:"
button1  =  "set"
button3  =  "Set"
Text  =  "Rotation adjustment"
comboBox1String_1 =  "0x00 （integer）"
comboBox1String_2 =  "0x01 （high byte）"
comboBox1String_3 =  "0x02 （ low byte）"

//滑动手势调节
[SwipeAdjustForm]
label5  =  "Slide mode"
label16  =  "Name"
label11  =  "VP (0x)"
label17  =  "Sensitivity（1 is the highest）"
checkBox3  =  "Data automatic upload"
label2  =  "Effective adjusting area"
TabText  =  "Sliding adjustment"
comboBox2String_1 =  "Lateral sliding"
comboBox2String_2 =  "Vertical sliding"


//滑动手势翻页
[SwipePageForm]
checkBox1  =  "No next page"
label1  =  "Next page:"   
button1  =  "set"       
checkBox2  =  "No previous page"
label19  =  "Previous page:"
button5  =  "set"
label16  =  "Name"
label11  =  "VP (0x)"
label17  =  Time 
checkBox3  =  "Data automatic upload"
groupBox3  =  Page sensitivity
(Distance/Time)
label3  =  Distance
label2  =  "Effective adjusting area"
TabText  =  "Page sliding"
label4 = "Auto Upload of Page ID"
myGroupBox1="End animation settings"
label6="End animation speed"
label5="Description:\r\n 0x00: End no animation; \r\n other values: unit of pixels divided by DGUS period, recommended value is horizontal resolution divided by 20"
label7="Sliding mode"
cbox1_item0="Horizontal"
cbox1_item1="Vertical"



//迪文ICO文件预览
[frm_ICON_Sel]
toolStripButton1  =  "Open"
tbrname  =  "Renumbered"
toolStripButton2  =  "Previous"
toolStripButton3  =  "Next"
toolStripButton4 =  "Generate ICO"
toolStripLabel1  =  "ICO file pixel selection"
LabToICO  =  "Route："
tabPage1  =  "ICO file generation"
label4  =  "File route："
grbDataSetting  =  " Pic size setting"
toolStripDropDownButton2  =  "Setting"
设置选择项ToolStripMenuItem  =  "Setting selection"
设置所有ToolStripMenuItem  =  "Setting all"
radioButton1  =  "Numbered as file"
lblWidth  =  "Wide："
lblHeight  =  "Height："
radioButton2  =  "Auto-numbered according to file order"
label6  =  "Reminder："
label5  =  "If need to modify or add \r\n pic to ICO file, please \r\n repeat first step and second step"
label3  =  "Or"
label2  =  "Second step："
button6  =  "Select pic file route"
button5  =  "Add to ICO file"
button1  =  "Generate new ICO file"
label1  =  "First step ："
textBox1  =  "Support format： \"ICO\", \"JPG\", \"BMP\", \"GIF\", \"PNG\"\r\n------------------------\r\n if pic is larger than 1023 then changing to 1023*1023" 
位置  =  "Location"
Column1  =  "File name"
Column2  =  "Resolution"
tabPage2  =  "ICO file preview"
button8  =  "Cancel"
button7  =  "OK"
checkBox1  =  "Filter background color or not"
button2  =  "Open file"
button3  =  "Previous"
button4  =  "Next"
dataGridViewTextBoxColumn1  =  "Location"
dataGridViewTextBoxColumn2  =  "File name"
dataGridViewTextBoxColumn3  =  "Resolution"
Text  =  "Dwin ICO file preview"


//图片预览
[imgview]
button1  =  "OK"
button2  =  "Cancel"
Text  =  "Pic preview"

//查看地址设置
[PageSetForm]
label1 =  "Current page ："
tabPage1 =  "VP (0x) view"
Text  =  "Address Watch"


//显示区域
[TDocumentSpaceForm]
label2 = "Segment"
checkBox2 = "Audio ID"
label1 = "Value(0x)"
checkBox1 = "Key Ctrl"
checkBox3="Locked"
String_1 =  "Open in error，please import config file or restoring"
String_2 =  "Animation display setting"
String_3 =  "Icon variable"
String_4 =  "Basic touch module"
String_5 =  "DGUS Tool project route: "
String_6 =  "File DWHMI (*.hmi)|*.hmi"
String_7 =  "Close project? If "yes", changes will not be saved"
String_8 =  "Reminder"
String_9 =  "Word bank cannot be found in [DWIN_SET] of the project，please copy word bank file in [DWIN_SET]"
String_10 =  "Loading successful"
String_11 =  "Save done!"
String_12 =  "Generation done，File name is： HMIConfig.bin，save under current project"
String_13 =  "There is no set up for generating configuration"
String_14 =  "Sure to delete selected pic?"
String_15 =  "Sure to delete all pic?"
String_16 =  "This is the last row"
String_17 =  "It is the last row"
String_18 =  "Please add pic first！"
String_19 =  "Please select a route！"
String_20 =  "The pic name of {0} and {1} is the same，please rename them."
String_21 =  "Config file is generated successfully!"
String_22 =  "Generation fail, please check the number of configuration"
String_23 =  "Generation fail, if the DWINSET menu can be read only"
String_24 =  "Generation fail!"
String_25 =  "Picture [ "
String_26 =  " ] Button configuration is intersecting, please check and retry."
String_27 =  " In page {0}，Variable address or Initial value set in error，please check"
String_28 =  "Export in error，please close Excel and retry"
String_29 =  "Export successfully！"
String_30 =  "Cannot find 13 config file，please select route again!"
String_31 =  "Cannot find 14 config file，please select route again!"
String_32 =  "Please open or create a project！"
String_33 =  "No picture to preview，please add pics in pic setting then starting preview"
String_34 =  "Save the project under a new catalogue, there are two ways, normal and 90 degree rotation.\r\n \r\n 1. Select “yes”, then the project will be saved originally in a new catalogue;\r\n 2. Select “no”, then the project will be saved in 90 degree rotation in a new catalogue.\r\n\r\n  The processing time is long, please wait patiently..."
String_35 =  "Picture"
String_36 =  "and"
String_37 =  "picture's description pointer have conflict!"
String_38 =  "Custom reminder"
String_39 =  ""
String_40 =  ""
String_41 =  ""
String_42 =  ""
String_43 =  ""
String_44 =  ""
String_45 =  ""
String_46 =  ""
String_47 =  ""
String_48 =  ""
String_49 =  ""
String_50 =  ""


//图标变量批量设置
[cfg_ICOvarForm]
checkBox1  =  "Select all"
toolStripButton1  =  "Move upper"
toolStripButton2  =  "Move down"
toolStripButton3  =  "Delete"
toolStripButton4  =  "Refresh to selected state"
checkBox3  =  "Variable limit increase in order--"
checkBox2  =  "VP increase in order--"
checkBox4  =  "Corresponding iconID 自动根据上下限联动变化"
label8  =  "Operation method:\r\n1、Double click the list, you can modify the touch button name and press the return key to confirm the modification\r\n2、When the list is selected, the selection can be selected on the design interface so that the user can correspond to the reference\r\n3、Click the Batch modify button to make the attributes of the hook option in the property bar consistent\r\n4、Click on the Move down button to change the order in the list, set in the list order"
checkBox5 =  "SP increase in order--"
button2  =  "Quit"
button1  =  "Batch modify"
Text  =  "Icon variable bulk setting"
String_1 =  "Basic property setting"
String_2 =  "Change or not"
String_3 =  "Identity"
String_4 =  "Property setting"
String_5 =  "SP"
String_6 =  "0000"
String_7 =  "VP "
String_8 =  "0000"
String_9 =  "Icon file"
String_10 =  "Minimum"
String_11 =  "ICON ID"
String_12 =  "Maximum"
String_13 =  "ICON ID"
String_14 =  "Display mode"
String_15 =  "Transparence"
String_16 =  "Background display"
String_17 =  "Initial value"

//ASCII录入批量设置
[cfg_AsciiInputForm]
checkBox1  =  "Select all"
toolStripButton1  =  "Move upper"
toolStripButton2  =  "Move down"
toolStripButton3  =  "Delete"
toolStripButton4  =  "Refresh to selected state"
checkBox2  =  "VP increase in order--"
checkBox3  =  "Show color"
button3  =  "set"
label8  =  "Operation method:\r\n1、Double click the list, you can modify the touch button name and press the return key to confirm the modification\r\n2、When the list is selected, the selection can be selected on the design interface so that the user can correspond to the reference\r\n3、Click the Batch modify button to make the attributes of the hook option in the property bar consistent\r\n4、Click on the Move down button to change the order in the list, set in the list order"
label4  =  "ASCII Input入"
button2  =  "Quit"
button1  =  "Batch modify"
Text  =  "ASCII input bulk setting"
String_1 =  "Basic property setting"
String_2 =  "Change or not"
String_3 =  "Identity"
String_4 =  "Property setting"
String_5 =  "Data auto-uploading"
String_6 =  "VP "
String_7 =  "0000"
String_8 =  "Button effect"
String_9 =  "Page switching"
String_10 =  "Text Length"
String_11 =  "Input Mode"
String_12 =  "Re-input"
String_13 =  "Edit Text"
String_14 =  "Font Lib_ID"
String_15 =  "Font Width"
String_16 =  "Font Height"
String_17 =  "Cursor color"
String_18 =  "Black"
String_19 =  "White"
String_20 =  "Auto Upload Value"
String_21 =  "Input display area "
String_22 =  "Display Mode"
String_23 =  "Direct display"
String_24 =  "Masked by(*)"
String_25 =  "Keyboard location"
String_26 =  "Current page"
String_27 =  "Other pages"
String_28 =  "Popup menu"
String_29 =  "Pages"
String_30 =  "Menu area "
String_31 =  "Set"
String_32 =  "Show location"


//基本触控批量设置
[cfg_BaseTouchForm]
checkBox1  =  "Select all1"
toolStripButton1  =  "Move upper"
toolStripButton2  =  "Move down"
toolStripButton3  =  "Delete"
toolStripButton4  =  "Refresh to selected state"
checkBox4  =  "Key value increase in order  --"
button3  =  "set"
label8  =  "Operation method:\r\n1、Double click the list, you can modify the touch button name and press the return key to confirm the modification\r\n2、When the list is selected, the selection can be selected on the design interface so that the user can correspond to the reference\r\n3、Click the Batch modify button to make the attributes of the hook option in the property bar consistent\r\n4、Click on the Move down button to change the order in the list, set in the list order"
label4  =  "Basic Touch"
button2  =  "Quit"
button1  =  "Batch modify"
Text  =  "Basic Touch bulk setting"
String_1 =  "Basic property setting"
String_2 =  "Change or not"
String_3 =  "Identity"
String_4 =  "Property setting"
String_5 =  "Button effect"
String_6 =  "Page switching"
String_7 =  "Key value"
String_8 =  "0000"



//QR code批量设置
[cfg_DimensionForm]
checkBox1  =  "Select all"
toolStripButton1  =  "Move upper"
toolStripButton2  =  "Move down"
toolStripButton3  =  "Delete"
toolStripButton4  =  "Refresh to selected state"
checkBox3  =  "SP increase in order--"
checkBox2  =  "VP increase in order--"
button3  =  "set基准"
label8  =  "Operation method:\r\n1、Double click the list, you can modify the touch button name and press the return key to confirm the modification\r\n2、When the list is selected, the selection can be selected on the design interface so that the user can correspond to the reference\r\n3、Click the Batch modify button to make the attributes of the hook option in the property bar consistent\r\n4、Click on the Move down button to change the order in the list, set in the list order"
label4  =  "QR code Setting"
button2  =  "Quit"
button1  =  "Batch modify"
Text  =  "QR code bulk Setting"
String_1 =  "Basic property setting"
String_2 =  "Change or not"
String_3 =  "Identity"
String_4 =  "Property setting"
String_5 =  "SP"
String_6 =  "0000"
String_7 =  "VP "
String_8 =  "0000"
String_9 =  "Unit_Pixels"

//数据显示量设置
[cfg_DisDataForm]
checkBox1  =  "Select all"
toolStripButton1  =  "Move upper"
toolStripButton2  =  "Move down"
toolStripButton3  =  "Delete"
toolStripButton4  =  "Refresh to selected state"
checkBox4  =  "SP increase in order--"
checkBox2  =  "VP increase in order--"
checkBox3  =  "Show color"
label8  =  "Operation method:\r\n1、Double click the list, you can modify the touch button name and press the return key to confirm the modification\r\n2、When the list is selected, the selection can be selected on the design interface so that the user can correspond to the reference\r\n3、Click the Batch modify button to make the attributes of the hook option in the property bar consistent\r\n4、Click on the Move down button to change the order in the list, set in the list order"
label4  =  "Data variables display"
button2  =  "Quit"
button1  =  "Batch modify"
Text  =  "Data variables display bulk setting"
String_1 =  "Basic property setting"
String_2 =  "Change or not"
String_3 =  "Identity"
String_4 =  "Property setting"
String_5 =  "SP"
String_6 =  "0000"
String_7 =  "VP "
String_8 =  "0000"
String_9 =  "Word bank ID"
String_10 =  "Font size"
String_11 =  "Alignment"
String_12 =  "Left"
String_13 =  "Right"
String_14 =  "Center"
String_15 =  "Variable type"
String_16 =  "0X00=Int (word)"
String_17 =  "0X01=Long int (double word)"
String_18 =  "0X02=*VP high byte"
String_19 =  "0X03=*VP low byte"
String_20 =  "0X04=Extra long lnt (8 bytes)"
String_21 =  "0X05=Unsigned Int (2 bytes)"
String_22 =  "0X06=Unsigned Int (4 bytes)"
String_27 =  "0X07=float"
String_28 =  "0X08=double"
String_23 =  "Integer digits"
String_24 =  "Decimal digits"
String_25 =  "Show unit"
String_26 =  "Initial value"

//文本显示批量设置
[cfg_DisTextForm]
checkBox1  =  "Select all"
toolStripButton1  =  "Move upper"
toolStripButton2  =  "Move down"
toolStripButton3  =  "Delete"
toolStripButton4  =  "Refresh to selected state"
checkBox4  =  "SP increase in order--"
checkBox2  =  "VP increase in order--"
checkBox3  =  "Show color"
label8  =  "Operation method:\r\n1、Double click the list, you can modify the touch button name and press the return key to confirm the modification\r\n2、When the list is selected, the selection can be selected on the design interface so that the user can correspond to the reference\r\n3、Click the Batch modify button to make the attributes of the hook option in the property bar consistent\r\n4、Click on the Move down button to change the order in the list, set in the list order"
label4  =  "Text display"
button2  =  "Quit"
button1  =  "Batch modify"
Text  =  "Text display bulk setting"
String_1 =  "Basic property setting"
String_2 =  "Change or not"
String_3 =  "Identity"
String_4 =  "Property setting"
String_5 =  "SP"
String_6 =  "0000"
String_7 =  "VP "
String_8 =  "0000"
String_9 =  "Encoding Mode"
String_10 =  "0x00=8bit"
String_11 =  "0x01=GB2312"
String_12 =  "0x02=GBK"
String_13 =  "0x03=BIG5"
String_14 =  "0x04=SJIS"
String_15 =  "0x05=UNICODE"
String_16 =  "Set character interval Manually"
String_17 =  "Text Length"
String_18 =  "FONT0ID"
String_19 =  "Font ID of the ASCII"
String_20 =  "FONT1ID"
String_21 =  "Font ID of others"
String_22 =  "X direction Lattice number"
String_23 =  "Y direction Lattice number"
String_24 =  "Horizontal interval"
String_25 =  "Vertical interval"
String_26 =  "Initial value"
String_27 =  "DWIN"
String_28 =  "Horizontal"
String_29="left"
String_30="right"
String_31="center"
String_32="right to left"
String_33 =  "Vertical"
String_34="up"
String_35="center"

//动画图标批量设置
[cfg_ICOAnimForm]
checkBox1  =  "Select all"
toolStripButton1  =  "Move upper"
toolStripButton2  =  "Move down"
toolStripButton3  =  "Delete"
toolStripButton4  =  "Refresh to selected state"
checkBox3  =  "SP increase in order--"
checkBox2  =  "VP increase in order--"
checkBox4  =  "Show color"
label8  =  "Operation method:\r\n1、Double click the list, you can modify the touch button name and press the return key to confirm the modification\r\n2、When the list is selected, the selection can be selected on the design interface so that the user can correspond to the reference\r\n3、Click the Batch modify button to make the attributes of the hook option in the property bar consistent\r\n4、Click on the Move down button to change the order in the list, set in the list order"
label4  =  "Animation Icon"
button2  =  "Quit"
button1  =  "Batch modify"
Text  =  "Animation Icon bulk setting"
String_1 =  "Basic property setting"
String_2 =  "Change or not"
String_3 =  "Identity"
String_4 =  "Property setting"
String_5 =  "SP"
String_6 =  "0000"
String_7 =  "VP "
String_8 =  "0000"
String_9 =  "Icon file"
String_10 =  "Stop value"
String_11 =  "Start value"
String_12 =  "Stop icon ID"
String_13 =  "Start icon ID"
String_14 =  "stop icon ID"
String_15 =  "Display mode"
String_16 =  "Transparence"
String_17 =  "Background display"
String_18 =  "Initial value"

//艺术字显示批量设置
[cfg_ICOArtForm]
checkBox1  =  "Select all"
toolStripButton1  =  "Move upper"
toolStripButton2  =  "Move down"
toolStripButton3  =  "Delete"
toolStripButton4  =  "Refresh to selected state"
checkBox3  =  "Sp in order--"
checkBox2  =  "VP increase in order--"
checkBox4  =  "Show color"
label8  =  "Operation method:\r\n1、Double click the list, you can modify the touch button name and press the return key to confirm the modification\r\n2、When the list is selected, the selection can be selected on the design interface so that the user can correspond to the reference\r\n3、Click the Batch modify button to make the attributes of the hook option in the property bar consistent\r\n4、Click on the Move down button to change the order in the list, set in the list order"
label4  =  "Artistic variables display"
button2  =  "Quit"
button1  =  "Batch modify"
Text  =  "Artistic variables display bulk setting"
String_1 =  "Basic property setting"
String_2 =  "Change or not"
String_3 =  "Identity"
String_4 =  "Property setting"
String_5 =  "SP"
String_6 =  "0000"
String_7 =  "VP "
String_8 =  "0000"
String_9 =  "Icon file"
String_10 =  "Start icon"
String_11 =  "Display mode"
String_12 =  "Transparence"
String_13 =  "Background display"
String_14 =  "Variable type"
String_15 =  "Int (2 bytes)"
String_16 =  "Long lnt (4 bytes)"
String_17 =  "*VP high byte"
String_18 =  "*VP low byte"
String_19 =  "Extra long lnt (8 bytes)"
String_20 =  "Unsigned Int (2 bytes)"
String_21 =  "Unsigned Long lnt (4 bytes)6
String_22 =  "Integer digits"
String_23 =  "Decimal digits"
String_24 =  "Alignment"
String_25 =  "Left"
String_26 =  "Right"
String_27 =  "Initial value"
String_28 =  "float 4bytes"
String_29 =  "double 8bytes"

//位变量图标批量设置
[cfg_ICOBitForm]
checkBox1  =  "Select all"
toolStripButton1  =  "Move upper"
toolStripButton2  =  "Move down"
toolStripButton3  =  "Delete"
toolStripButton4  =  "Refresh to selected state"
checkBox3  =  "SP increase in order--"
checkBox2  =  "VP increase in order--"
checkBox4  =  "Show color"
label8  =  "Operation method:\r\n1、Double click the list, you can modify the touch button name and press the return key to confirm the modification\r\n2、When the list is selected, the selection can be selected on the design interface so that the user can correspond to the reference\r\n3、Click the Batch modify button to make the attributes of the hook option in the property bar consistent\r\n4、Click on the Move down button to change the order in the list, set in the list order"
label4  =  "Bit variables icon display"
button2  =  "Quit"
button1  =  "Batch modify"
Text  =  "Bit variables icon display bulk setting"
String_1 =  "Basic property setting"
String_2 =  "Change or not"
String_3 =  "Identity"
String_4 =  "Property setting"
String_5 =  "SP"
String_6 =  "0000"
String_7 =  "VP "
String_8 =  "0000"
String_9 =  "Display mode"
String_10 =  "Moving mode"
String_11 =  "Moving interval"
String_12 =  "Bit control setting"
String_13 =  "0000"
String_14 =  "Icon file"
String_15 =  "Background display"
String_16 =  "Transparence"
String_17 =  "Background display"
String_18 =  "AP "
String_19 =  "0000"
String_20 =  "Initial value"

//图片旋转批量设置
[cfg_ICORotationForm]
checkBox1  =  "Select all"
toolStripButton1  =  "Move upper"
toolStripButton2  =  "Move down"
toolStripButton3  =  "Delete"
toolStripButton4  =  "Refresh to selected state"
checkBox3  =  "SP increase in order--"
checkBox2  =  "VP increase in order--"
checkBox4  =  "Show color"
label8  =  "Operation method:\r\n1、Double click the list, you can modify the touch button name and press the return key to confirm the modification\r\n2、When the list is selected, the selection can be selected on the design interface so that the user can correspond to the reference\r\n3、Click the Batch modify button to make the attributes of the hook option in the property bar consistent\r\n4、Click on the Move down button to change the order in the list, set in the list order"
label4  =  "Icon rotation"
button2  =  "Quit"
button1  =  "Batch modify"
Text  =  "Icon rotation bulk setting"
String_1 =  "Basic property setting"
String_2 =  "Change or not"
String_3 =  "Identity"
String_4 =  "Property setting"
String_5 =  "SP"
String_6 =  "0000"
String_7 =  "VP "
String_8 =  "0000"
String_9 =  "Icon file"
String_10 =  "Icon ID"
String_11 =  "ICON Rotation Center"
String_12 =  "Start  Variable"
String_13 =  "End Variable"
String_14 =  "Start angle"
String_15 =  "End angle"
String_16 =  "Display mode"
String_17 =  "Transparence"
String_18 =  "Background display"
String_19 =  "Variable type"
String_20 =  "Int"
String_21 =  "high byte"
String_22 =  "low byte"
String_23 =  "Initial value"

//Sliding scale批量设置
[cfg_ICOSliderForm]
checkBox1  =  "Select all"
toolStripButton1  =  "Move upper"
toolStripButton2  =  "Move down"
toolStripButton3  =  "Delete"
toolStripButton4  =  "Refresh to selected state"
checkBox3  =  "SP increase in order--"
checkBox2  =  "VP increase in order--"
checkBox4  =  "Show color"
label8  =  "Operation method:\r\n1、Double click the list, you can modify the touch button name and press the return key to confirm the modification\r\n2、When the list is selected, the selection can be selected on the design interface so that the user can correspond to the reference\r\n3、Click the Batch modify button to make the attributes of the hook option in the property bar consistent\r\n4、Click on the Move down button to change the order in the list, set in the list order"
label4  =  "Sliding scale"
button2  =  "Quit"
button1  =  "Batch modify"
Text  =  "Sliding scale bulk setting"
String_1 =  "Basic property setting"
String_2 =  "Change or not"
String_3 =  "Identity"
String_4 =  "Property setting"
String_5 =  "SP"
String_6 =  "0000"
String_7 =  "VP "
String_8 =  "0000"
String_9 =  "Icon file"
String_10 =  "initial variable"
String_11 =  "Terminal variable"
String_12 =  "Slide icon"
String_13 =  "Scale value mode"
String_14 =  "Horizontal"
String_15 =  "Vertical"
String_16 =  "Coordinate forward offset"
String_17 =  "Display mode"
String_18 =  "Transparence"
String_19 =  "Background display"
String_20 =  "Variable type"
String_21 =  "Int"
String_22 =  "high byte"
String_23 =  "low byte"
String_24 =  "Initial value"



//增量调节批量设置
[cfg_IncAdjustmentForm]
checkBox4  =  "Select all"
toolStripButton1  =  "Move upper"
toolStripButton2  =  "Move down"
toolStripButton3  =  "Delete"
toolStripButton4  =  "Refresh to selected state"
checkBox1  =  "Write in byte increase in order"
checkBox2  =  "VP increase in order--"
label6  =  "Bit num 0x"
label8  =  "Operation method:\r\n1、Double click the list, you can modify the touch button name and press the return key to confirm the modification\r\n2、When the list is selected, the selection can be selected on the design interface so that the user can correspond to the reference\r\n3、Click the Batch modify button to make the attributes of the hook option in the property bar consistent\r\n4、Click on the Move down button to change the order in the list, set in the list order"
radioButton4 =  "Bit control"
radioButton3 =  "low byte"
radioButton2 =  "high byte"
radioButton1 =  "Int"
button2  =  "Quit"
button1  =  "Batch modify"
Text  =  "Incremental adjustment bulk setting"
String_1 =  "Basic property setting"
String_2 =  "Change or not"
String_3 =  "Identity"
String_4 =  "Property setting"
String_5 =  "Data auto-uploading"
String_6 =  "VP "
String_7 =  "0000"
String_8 =  "Button effect"
String_9 =  "Adjust method"
String_10 =  "Over limit Operation "
String_11 =  "Stop"
String_12 =  "Cycle"
String_13 =  "Adjusting step length"
String_14 =  "Upper limit"
String_15 =  "Lower limit"
String_16 =  "Touch effect"
String_17 =  "Constant Setting"
String_18 =  "Disposable Setting"





//弹出菜单批量设置
[cfg_PopMenuForm]
checkBox4  =  "Select all"
toolStripButton1  =  "Move upper"
toolStripButton2  =  "Move down"
toolStripButton3  =  "Delete"
toolStripButton4  =  "Refresh to selected state"
checkBox1  =  "Write in byte increase in order"
checkBox2  =  "VP increase in order--"
label6  =  "Bit num  0x"
label8  =  "Operation method:\r\n1、Double click the list, you can modify the touch button name and press the return key to confirm the modification\r\n2、When the list is selected, the selection can be selected on the design interface so that the user can correspond to the reference\r\n3、Click the Batch modify button to make the attributes of the hook option in the property bar consistent\r\n4、Click on the Move down button to change the order in the list, set in the list order"
radioButton4 =  "Bit control"
radioButton3 =  "low byte"
radioButton2 =  "high byte"
radioButton1 =  "Int"
button2  =  "Quit"
button1  =  "Batch modify"
Text  =  "Popup menu bulk setting"
String_1 =  "Basic property setting"
String_2 =  "Change or not"
String_3 =  "Identity"
String_4 =  "Property setting"
String_5 =  "Data auto-uploading"
String_6 =  "VP "
String_7 =  "0000"
String_8 =  "Button effect"
String_9 =  "Popup menu"
String_10 =  "Pages"
String_11 =  "Menu area "
String_12 =  "Setting"
String_13 =  "Show location"


//按键返回批量设置
[cfg_ReKeyForm]
checkBox5  =  "Select all"
toolStripButton1  =  "Move upper"
toolStripButton2  =  "Move down"
toolStripButton3  =  "Delete"
toolStripButton4  =  "Refresh to selected state"
checkBox1  =  "Write in byte increase in order"
checkBox2  =  "VP increase in order--"
label6  =  "Bit num  0x"
label8  =  "Operation method:\r\n1、Double click the list, you can modify the touch button name and press the return key to confirm the modification\r\n2、When the list is selected, the selection can be selected on the design interface so that the user can correspond to the reference\r\n3、Click the Batch modify button to make the attributes of the hook option in the property bar consistent\r\n4、Click on the Move down button to change the order in the list, set in the list order"
radioButton4 =  "Bit control"
radioButton3 =  "low byte"
radioButton2 =  "high byte"
radioButton1 =  "Int"
button2  =  "Quit"
button1  =  "Batch modify"
Text  =  "Data return bulk setting"
String_1 =  "Basic property setting"
String_2 =  "Change or not"
String_3 =  "Identity"
String_4 =  "Property setting"
String_5 =  "Data auto-uploading"
String_6 =  "VPs "
String_7 =  "0000"
String_8 =  "Button effect"
String_9 =  "Page switching"
String_10 =  "Key value setting "
String_11 =  "0000"


//拖动调节批量设置
[cfg_SliderAdjustForm]
checkBox5  =  "Select all"
toolStripButton1  =  "Move upper"
toolStripButton2  =  "Move down"
toolStripButton3  =  "Delete"
toolStripButton4  =  "Refresh to selected state"
checkBox1  =  "Write in byte increase in order"
checkBox2  =  "VP increase in order--"
label6  =  "Write in byte 0x"
label8  =  "Operation method:\r\n1、Double click the list, you can modify the touch button name and press the return key to confirm the modification\r\n2、When the list is selected, the selection can be selected on the design interface so that the user can correspond to the reference\r\n3、Click the Batch modify button to make the attributes of the hook option in the property bar consistent\r\n4、Click on the Move down button to change the order in the list, set in the list order"
radioButton4 =  "Bit control"
radioButton3 =  "Write in low byte"
radioButton2 =  "Write in high byte"
radioButton1 =  "Write in variables by byte"
button2  =  "Quit"
button1  =  "Batch modify"
Text  =  "Drag adjustment bulk setting"
String_1 =  "Basic property setting"
String_2 =  "Change or not"
String_3 =  "Identity"
String_4 =  "Property setting"
String_5 =  "Data auto-uploading"
String_6 =  "VP "
String_7 =  "0000"
String_8 =  "Start Value"
String_9 =  "Terminated Value"
String_10 =  "Dragging mode"
String_11 =  "Data return mode"
String_12 =  "Int"
String_13 =  "high byte"
String_14 =  "low byte"
String_15 =  "Mode"
String_16 =  "Horizontal"
String_17 =  "Vertical"


//变量数据录入批量设置
[cfg_VarinputForm]
checkBox5  =  "Select all"
toolStripButton1  =  "Move upper"
toolStripButton2  =  "Move down"
toolStripButton3  =  "Delete"
toolStripButton4  =  "Refresh to selected state"
checkBox3  =  "Show color"
checkBox2  =  "VP increase in order--"
label6  =  "Write in byte 0x"
label8  =  "Operation method:\r\n1、Double click the list, you can modify the touch button name and press the return key to confirm the modification\r\n2、When the list is selected, the selection can be selected on the design interface so that the user can correspond to the reference\r\n3、Click the Batch modify button to make the attributes of the hook option in the property bar consistent\r\n4、Click on the Move down button to change the order in the list, set in the list order"
radioButton4 =  "Bit control"
radioButton3 =  "Write in low byte"
radioButton2 =  "Write in high byte"
radioButton1 =  "Write variables by byte"
button2  =  "Quit"
button1  =  "Batch modify"
Text  =  "Variable data input bulk setting"
String_1 =  "Basic property setting"
String_2 =  "Change or not"
String_3 =  "Identity"
String_4 =  "Property setting"
String_5 =  "Data auto-uploading"
String_6 =  "VP "
String_7 =  "0000"
String_8 =  "Button effect"
String_9 =  "Picture switching"
String_10 =  "Variable type"
String_11 =  "0X00=Int (word)"
String_12 =  "0X01=Long int(double word)"
String_13 =  "0X02=high byte"
String_14 =  "0X03=low byte"
String_15 =  "0X04=Extra long lnt(8 bytes)"
String_16 =  "Integer digits"
String_17 =  "Decimal digits"
String_18 =  "Input display area "
String_19 =  "Font ID"
String_20 =  "Font size"
String_21 =  "Cursor color"
String_22 =  "Black"
String_23 =  "White"
String_24 =  "Display method of input"
String_25 =  "Display'*'"
String_26 =  "Direct display"
String_27 =  "Keyboard location"
String_28 =  "Current page"
String_29 =  "Other pages"
String_30 =  "Popup menu"
String_31 =  "Pages"
String_32 =  "Menu area "
String_33 =  "Setting"
String_34 =  "Show location"
String_35 =  "Enabling limits"
String_36 =  "Upper limit"
String_37 =  "Lower limit"
String_38 =  "Loading data when input"
String_39 =  "Loading address"
String_40 =  "0000"
String_41 =  "Loading data"



//
[]


